[
  {
    "Subject": "CSCI",
    "Number": 134,
    "Attributes": "BGNP_BGNPREC,COGS_COGSELEC,DIV_D3,QFR_QFR",
    "Professor": "Iris Howley",
    "Title": "CSCI 134 Diving into the Deluge of Data",
    "Tags": "computer science;programming;software engineering;data analytics;technology;computer science graduate school;intro class;ESSENTIAL",
    "Timeslot": "MWF 11:00-11:50; - ; -",
    "Prereqs": "",
    "Description": "Using the programming language Python, students will learn to design algorithms to search, sort, and manipulate data in application areas like text and image processing, social networks, scientific computing, databases, and the web. Programming topics covered include object-oriented and functional programming, control structures, types, recursion, arrays, lists, streams, and dictionaries. This course is appropriate for all students who want to create software and learn computational techniques."
  },
  {
    "Subject": "CSCI",
    "Number": 136,
    "Attributes": "BGNP_BGNPREC,DIV_D3,QFR_QFR",
    "Professor": "Daniel W. Barowy",
    "Title": "CSCI 136 Data Strctures & Advanced Prog",
    "Tags": "computer science;programming;software engineering;technology;computer science graduate school;intro class",
    "Timeslot": "MWF 11:00-11:50; - ; -",
    "Prereqs": "CSCI 134",
    "Description": "This course builds on the programming skills acquired in Computer Science 134. It couples work on program design, analysis, and verification with an introduction to the study of data structures. Data structures capture common ways in which to store and manipulate data, and they are important in the construction of sophisticated computer programs. Students are introduced to some of the most important and frequently used data structures."
  },
  {
    "Subject": "CSCI",
    "Number": 237,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Duane A. Bailey",
    "Title": "CSCI 237 Computer Organization",
    "Tags": "computer science;network engineering; systems engineering;hardware engineering;software engineering;technology;systems architecture;",
    "Timeslot": "MWF 10:00-10:50; - ; -",
    "Prereqs": "CSCI 134",
    "Description": "This course studies the basic instruction set architecture and organization of a modern computer. Over the semester the student learns the fundamentals of translating higher level languages into assembly language, and the interpretation of machine languages by hardware. At the same time, a model of computer hardware organization is developed from the gate level upward. Final projects focus on the design of a complex control system in hardware or firmware."
  },
  {
    "Subject": "CSCI",
    "Number": 256,
    "Attributes": "BGNP_BGNPREC,DIV_D3,QFR_QFR",
    "Professor": "William J. Lenhart",
    "Title": "CSCI 256 Algorithm Design & Analysis",
    "Tags": "computer science;software engineering;programming;computer science graduate school;",
    "Timeslot": "MWF 12:00-12:50; - ; -",
    "Prereqs": "CSCI 136",
    "Description": "Understanding underlying structures present in many kinds of data often allows us to design highly efficient algorithms. This understanding can also be used to prove the correctness of an algorithm and bound its run time and space needs. Building on skills acquired in Computer Science 136, we study a range of design strategies, including induction, divide-and-conquer, dynamic programming, and greedy methods. In addition, we explore strategies for handling potentially intractable problems."
  },
  {
    "Subject": "CSCI",
    "Number": 333,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Bill K. Jannen",
    "Title": "CSCI 333 Storage Systems",
    "Tags": "computer science;systems architecture;systems engineering;",
    "Timeslot": "MR 14:35-15:50; - ; -",
    "Prereqs": "CSCI 136; CSCI 237",
    "Description": "This course will examine topics in the design, implementation, and evaluation of storage systems. Topics include the memory hierarchy; ways that data is organized (both logically and physically); storage hardware and its influence on storage software designs; data structures; performance models; and system measurement/evaluation. Readings will be taken from recent technical literature, and an emphasis will be placed on identifying and evaluating design trade-offs."
  },
  {
    "Subject": "CSCI",
    "Number": 334,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Stephen N. Freund",
    "Title": "CSCI 334 Principles of Programming Lang",
    "Tags": "computer science;programming;app development;web development;computer science graduate school",
    "Timeslot": "TR 09:55-11:10; - ; -",
    "Prereqs": "CSCI 136",
    "Description": "This course examines the concepts and structures governing the design and implementation of programming languages. It presents an introduction to the concepts behind compilers and run-time representations of programming languages; features of programming languages supporting abstraction and polymorphism; and the procedural, functional, object-oriented, and concurrent programming paradigms. Programs will be required in languages illustrating each of these paradigms."
  },
  {
    "Subject": "ECON",
    "Number": 110,
    "Attributes": "DIV_D2,POEC_POECREQ,QFR_QFR",
    "Professor": "Susan Godlonton",
    "Title": "ECON 110 Principles of Microeconomics",
    "Tags": "economics;ESSENTIAL; business;politics;banking;finance;consulting;asset managment;law;quantitative trading;private equity;graduate school;mathematics;micro economics;software;computer science;intro class",
    "Timeslot": "TR 08:30-09:45; - ; -",
    "Prereqs": "",
    "Description": "This course is an introduction to the study of the forces of supply and demand that determine prices and the allocation of resources in markets for goods and services, markets for labor, and markets for natural resources. The focus is on how and why markets work, why they may fail to work, and the policy implications of both their successes and failures. The course focuses on developing the basic tools of microeconomic analysis and then applying those tools to topics of popular or policy interest such as minimum wage legislation, pollution control, competition policy, international trade policy, discrimination, tax policy, and the role of government in a market economy."
  },
  {
    "Subject": "ECON",
    "Number": 120,
    "Attributes": "DIV_D2,POEC_POECREQ,QFR_QFR",
    "Professor": "Quamrul H. Ashraf",
    "Title": "ECON 120 Principles of Macroeconomics",
    "Tags": "economics;macroeconomics;monetary economics;political science;politics;social justice;history;finance;banking;consulting;asset management;private equity;gender studies;feminism",
    "Timeslot": "TF 13:10-14:25; - ; -",
    "Prereqs": "ECON 110",
    "Description": "This course provides an introduction to the study of the aggregate national economy. It develops the basic theories of macroeconomics and applies them to topics of current interest. Issues to be explored include: the causes of inflation, unemployment, recessions, and depressions; the role of government fiscal and monetary policy in stabilizing the economy; the determinants of long-run economic growth; the long- and short-run effects of taxes, budget deficits, and other government policies on the national economy; the role of financial frictions in amplifying recessions; and the workings of exchange rates and international finance."
  },
  {
    "Subject": "ECON",
    "Number": 213,
    "Attributes": "DIV_D2,ENVI_ENVIPOL,POEC_POECCOMP,QFR_QFR",
    "Professor": "Sarah A. Jacobson",
    "Title": "ECON 213 Intro Envi & Nat'l Resrce Econ",
    "Tags": "economics;environmental;cost benefit analysis;natural resources;sustainibility;ecosystems;climate change;social justice",
    "Timeslot": "MW 11:00-12:15; - ; -",
    "Prereqs": "ECON 110",
    "Description": "We'll use economics to learn why we harm the environment and overuse natural resources, and what we can do about it. We'll talk about whether and how we can put a dollar value on nature and ecosystem services. We'll study cost benefit analysis, pollution in general, climate change, natural resources (like fisheries, forests, and fossil fuels), and energy. We will take an economic approach to global sustainability, and study the relationship between the environment and economic growth and trade."
  },
  {
    "Subject": "ECON",
    "Number": 215,
    "Attributes": "DIV_D2,GBST_GBSTECON,MAST_MASTELEC,POEC_POECINTL",
    "Professor": "Will Olney",
    "Title": "ECON 215 Globalization",
    "Tags": "economics;macroeconomics;politics;political science;immigration;globalization;inequalities;finance;asset management",
    "Timeslot": "TR 08:30-09:45; - ; -",
    "Prereqs": "ECON 110",
    "Description": "This course will examine the causes and consequences of globalization. This includes studying topics such as trade, immigration, foreign direct investment, and offshoring. The impact of these forms of globalization on welfare, wages, employment, and inequality will be a focal point. Throughout we will rely on economic principles, models, and empirical tools to explain and examine these contentious issues."
  },
  {
    "Subject": "ECON",
    "Number": 229,
    "Attributes": "DIV_D2,POEC_POECAMER,QFR_QFR",
    "Professor": "Don Carlson",
    "Title": "ECON 229 Law and Economics",
    "Tags": "economics;law;law school;graduate school;venture capital;start up;entrepreneurship;entrepreneur;legal system;banking;finance",
    "Timeslot": "M 19:00-21:40; - ; -",
    "Prereqs": "ECON 110",
    "Description": "This course applies the tools of microeconomic analysis to private (i.e., civil) law. This analysis has both positive and normative aspects. The positive aspects deal with how individuals respond to the incentives created by the legal system. Examples include: how intellectual property law encourages the creation of knowledge while simultaneously restricting the dissemination of intellectual property; how tort law motivates doctors to avoid malpractice suits; and how contract law facilitates agreements. The normative aspects of the analysis ask whether legal rules enhance economic efficiency (or, more broadly, social welfare). Examples include: what legal rules are most appropriate for mitigating pollution, ensuring safe driving, and guaranteeing workplace safety? The course will also cover the economics of legal systems; for example, what are the incentives for plaintiffs to initiate lawsuits and what role do lawyers play in determining outcomes. The course will also consider potential reforms of the legal system. In the 2014-15 academic year, the course will place more emphasis on intellectual property law as part of the campus-wide initiative, \"The Book Unbound,\" associated with the opening of the new library."
  },
  {
    "Subject": "ECON",
    "Number": 251,
    "Attributes": "DIV_D2,QFR_QFR",
    "Professor": "Stephen C. Sheppard",
    "Title": "ECON 251 Price and Allocation Theory",
    "Tags": "economics;graduate school;banking;finance;asset management; private equity; quantitative trading;business;applied mathematics; microeconomics;mathematics",
    "Timeslot": "TF 13:10-14:25; - ; -",
    "Prereqs": "ECON 110",
    "Description": "A study of the determination of relative prices and their importance in shaping the allocation of resources and the distribution of income. Subjects include: behavior of households in a variety of settings, such as buying goods and services, saving, and labor supply; behavior of firms in various kinds of markets; results of competitive and noncompetitive markets in goods, labor, land, and capital; market failure; government policies as sources of and responses to market failure; welfare criteria; limitations of mainstream analysis."
  },
  {
    "Subject": "ECON",
    "Number": 252,
    "Attributes": "DIV_D2,QFR_QFR",
    "Professor": "Peter J. Montiel",
    "Title": "ECON 252 Macroeconomics",
    "Tags": "economics;graduate school;banking;finance;consulting;political economy;politics;political science;asset management;quantitative trading; applied mathematics",
    "Timeslot": "MW 11:00-12:15; - ; -",
    "Prereqs": "ECON 110 ; ECON 120",
    "Description": "A study of aggregate economic activity: output, employment, inflation, and interest rates. The class will develop a theoretical framework for analyzing economic growth and business cycles. The theory will be used to evaluate policies designed to promote growth and stability, and to understand economic developments in the U.S. and abroad. Instructors may use elementary calculus in assigned readings, exams and lectures."
  },
  {
    "Subject": "ECON",
    "Number": 255,
    "Attributes": "DIV_D2,EVST_EVSTMETH,PHLH_PHLHSTAT,POEC_POECREQ,QFR_QFR",
    "Professor": "Anand V. Swamy",
    "Title": "ECON 255 Econometrics",
    "Tags": "economics;applied mathematics;mathematics;statistics;math graduate school; quantitative trading;banking;finance;private equity;business; ESSENTIAL;consulting;political economy;big data;financial markets",
    "Timeslot": "TR 11:20-12:35; - ; -",
    "Prereqs": "MATH 130",
    "Description": "An introduction to the theory and practice of applied quantitative economic analysis. This course familiarizes students with the strengths and weaknesses of the basic empirical methods used by economists to evaluate economic theory against economic data. Emphasizes both the statistical foundations of regression techniques and the practical application of those techniques in empirical research. Computer exercises will provide experience in using the empirical methods, but no previous computer experience is expected. Highly recommended for students considering graduate training in economics or public policy."
  },
  {
    "Subject": "ECON",
    "Number": 257,
    "Attributes": "DIV_D2,DPE_DPE,POEC_POECAMER",
    "Professor": "Owen Thompson",
    "Title": "ECON 257 The Economics of Race",
    "Tags": "economics;macroeconomics;race;racial equality;social justice;politics;political economy;graduate school;political science graduate school;",
    "Timeslot": "TF 13:10-14:25; - ; -",
    "Prereqs": "ECON 110",
    "Description": "This course will examine the causes and consequences of racial disparities in economic outcomes. Specific topics will include the economic history of slavery, Reconstruction and the Civil Rights Movement; racial gaps in earnings, wealth, educational attainment, standardized test scores, and health outcomes; formal models of taste-based and statistical discrimination; and the structure and efficacy of government anti-discrimination policies.\n \n Much of the course will focus on racial discrimination faced by African Americans specifically, but there will also be coverage of other racial and ethnic minority groups. The course will additionally focus almost exclusively on the US, although many of the theories and techniques we will develop are applicable to other contexts as well.\n \n The course will utilize basic microeconomic tools, such as straightforward extensions of the supply and demand model, and ECON 110 is a prerequisite. We will also make extensive use of descriptive statistics, and an introductory statistics course such as STAT 101 will be useful, but is not required."
  },
  {
    "Subject": "ECON",
    "Number": 352,
    "Attributes": "DIV_D2,GBST_GBSTECON,POEC_POECCOMP",
    "Professor": "Gerard Caprio",
    "Title": "ECON 352 Financial Development&Regultn",
    "Tags": "economics;corporate finance;finance;financial markets;political science;",
    "Timeslot": "MW 11:00-12:15; - ; -",
    "Prereqs": "ECON 255",
    "Description": "This course focuses on the financial system and its role in economic development. The first part explores the functions of finance, how it contributes to growth and income inequality, examining what can be done to increase financial inclusion. It will examine experiences with financial sector repression and subsequent liberalization, and investigate the causes and impact of financial crises. Then it will study how to make finance effective and how to prevent or minimize crises, analyzing government's role as regulator, supervisor, standard setter, contract enforcer, and owner. In this final part, attention will be devoted to the role of institutions (laws, norms, culture) and incentives in financial sector development."
  },
  {
    "Subject": "ECON",
    "Number": 357,
    "Attributes": "DIV_D2",
    "Professor": "David J. Zimmerman",
    "Title": "ECON 357 Economics of Higher Education",
    "Tags": "economics;education;econometrics;teaching;economics graduate school",
    "Timeslot": "TBA - ; - ; -",
    "Prereqs": "ECON 251; ECON 255",
    "Description": "This tutorial will utilize economic theory and econometric methods to understand a variety of issues pertaining to the economics of colleges and universities. In particular, we'll discuss the logic of non-profit enterprises, the financial structure of a college or university, competition in the market for higher education, policies impacting tuition and financial aid, the individual and societal returns from investments in higher education, and the distinctive features of academic labor markets. Particular attention will be paid to selective liberal arts colleges."
  },
  {
    "Subject": "ECON",
    "Number": 359,
    "Attributes": "DIV_D2,GBST_GBSTECON,POEC_POECINTL",
    "Professor": "Peter J. Montiel",
    "Title": "ECON 359 Developing Country Macro II",
    "Tags": "global development;economics;macroeconomics;global economics;developmental economics;political economy;finance;research;economics graduate school;",
    "Timeslot": "MWF 08:30-09:45; - ; -",
    "Prereqs": "ECON 505",
    "Description": "Developing countries do not find it difficult to initiate rapid growth, but do find it difficult to sustain it. Growth spurts are often derailed by macroeconomic shocks. As developing countries become increasingly open to trade and financial interactions with the rest of the world, such shocks may become more frequent, and potentially more severe. This course examines the types of macroeconomic institutions and policy regimes that can help developing countries withstand such shocks and sustain economic growth. We will examine fiscal rules, policies toward the domestic financial sector, central bank independence, the design of monetary and exchange rate regimes, and capital account regimes. We will also consider how shortcomings in institutions and policy regimes have contributed to macroeconomic crises in developing countries ."
  },
  {
    "Subject": "ECON",
    "Number": 360,
    "Attributes": "DIV_D2,GBST_GBSTECON,POEC_POECINTL,QFR_QFR",
    "Professor": "Kenneth N. Kuttner",
    "Title": "ECON 360 Monetary Economics",
    "Tags": "economics;macroeconomics;wall street;finance;economics graduate school;cryptocurrencies;banking;advanced macroeconomics;quantitative trading;financial markets;private equity;",
    "Timeslot": "MWF 08:30-09:45; - ; -",
    "Prereqs": "ECON 252; ECON 255",
    "Description": "This course covers a range of theoretical and applied issues bearing on monetary policy as conducted in the U.S. and abroad. Topics to be discussed include: What causes inflation? What are the channels through which monetary policy affects the economy? Why should central banks commit to policy rules? How do exchange rates respond to monetary policy? How did the gold standard work? And will cryptocurrencies replace the dollar? In addition, we will develop and learn how to simulate the \"New Keynesian\" macroeconomic model, which has become the standard framework for monetary policy analysis for central banks around the world."
  },
  {
    "Subject": "ECON",
    "Number": 362,
    "Attributes": "DIV_D2,GBST_GBSTECON",
    "Professor": "Michael Fortunato",
    "Title": "ECON 362 Global Competitive Strategies",
    "Tags": "economics;macroeconomics;financial markets;banking;quantitative trading;economics graduate school;welfare economics;political science;politics;",
    "Timeslot": "M 19:00-21:40; - ; -",
    "Prereqs": "ECON 251",
    "Description": "This course maintains an IO perspective, acknowledging the centrality of large, multinational firms in determining the pattern and success of a nation's international economic activities (which include, but are not limited to, a wide range of licensing, trade, and diverse configurations of foreign direct investment activities, and their implications for employment, profitability, and social welfare at home and abroad.) In this sense, we depart from international economic approaches that focus foremost on the ways in which a country's factor endowments, domestic market characteristics, and government policies promote or impede such activities, although in our treatment we do not neglect these factors, but treat them as constraints upon, or resources supporting, the optimizing behaviors of large firms. During and following a case-based module in which we learn and simulate the strategic decision processes used by executives of multinationals, we examine the actual trade and investment decisions of those firms, compare them to the predictions of international trade and multinational IO theories, and seek to explain divergences where they are identified. Throughout, competitive strategies of domestic and foreign rivals in markets around the world are explored. As well, the types and efficacy of various government policies in promoting the competitiveness of industries in regional and global markets -- and how they are linked to recent work in growth theory -- are examined. Further, substantial recent shifts in the nature of globalized economic activity, including the changing relative mobility and power of capital and labor, are examined. Finally, welfare propositions and policy ideas for addressing welfare impacts are advanced and discussed. Written cases, class participation, a mid-term exam, and a final paper or exam are expected."
  },
  {
    "Subject": "ECON",
    "Number": 366,
    "Attributes": "DIV_D2,GBST_GBSTECON,POEC_POECINTL",
    "Professor": "Will Olney",
    "Title": "ECON 366 International Trade&Developmnt",
    "Tags": "economics;macroeconomics;advanced macroeconomics;developmental economics;econometrics;",
    "Timeslot": "TR 09:55-11:10; - ; -",
    "Prereqs": "ECON 251; ECON 255",
    "Description": "This course will examine the causes and consequences of globalization and its implications for less-developed countries. We will study the classic models of international trade and discuss the empirical relevance of these theories. In addition, we will focus on other dimensions of globalization that are of particular importance to developing countries such as trade and education, emigration, brain drain, remittances, foreign direct investment, trade policies, infant industry protection, trade and growth, the resource course, and trade agreements."
  },
  {
    "Subject": "ECON",
    "Number": 379,
    "Attributes": "DIV_D2,PHLH_PHLHMETH,POEC_POECCOMP,QFR_QFR",
    "Professor": "Susan Godlonton",
    "Title": "ECON 379 Prog Eval for Int'l Develop",
    "Tags": "economics;macroeconomics;developmental economics;econometrics;",
    "Timeslot": "TR 11:20-12:35; - ; -",
    "Prereqs": "ECON 110; POEC 253",
    "Description": "Development organizations face strict competition for scarce resources. Both public and private organizations are under increasing pressure to use rigorous program evaluation in order to justify funding for their programs and to design more effective programs. This course is an introduction to evaluation methodology and the tools available to development practitioners, drawing on examples from developing countries. It will cover a wide range of evaluation techniques and discuss the advantages and disadvantages of each. The course is a mix of applied econometrics and practical applications covering implementation, analysis, and interpretation. You will learn to be a critical reader of evaluations, and to develop your own plan to evaluate an existing program of your choice."
  },
  {
    "Subject": "ECON",
    "Number": 389,
    "Attributes": "DIV_D2,POEC_POECCOMP,POEC_POECINTL,QFR_QFR",
    "Professor": "Jon M. Bakija",
    "Title": "ECON 389 Tax Policy in Global Perspctv",
    "Tags": "economics;macroeconomics;monetary economics;political science;politics;taxation;finance;wall street;law;welfare economics;",
    "Timeslot": "TR 08:30-09:45; - ; -",
    "Prereqs": "ECON 110; POEC 253",
    "Description": "Taxes are half of what government does. So if you are interested in what government policy can do to promote efficiency, equity, and economic development, you should be interested in tax policy. Governments must raise tax revenue to finance critical public goods, address other market failures and distributional issues, and to avoid problems with debt and inflation. Taxes typically take up anywhere from ten to fifty percent of a country's income, they profoundly affect the incentives to undertake all varieties of economic activity, and the government expenditures that they finance have potentially large consequences for human welfare. So the stakes involved in improving tax policy are quite large. This class provides an in-depth exploration of tax policy, from a global and comparative perspective. Because most students in this class will be CDE fellows, we will emphasize tax policy issues, examples, and evidence that are most pertinent to developing countries, but we will also learn something about tax systems in the U.S. and other industrialized nations. Topics addressed in this class include: how basic economic principles can be applied to help one think about the efficiency and equity consequences of tax policies; how personal income taxes, corporate income taxes, and value-added taxes are designed and administered and how they influence the economy; ideas for fundamental reforms of these taxes; theory and evidence in the debate over progressive taxes versus \"flat\" taxes; how various elements of tax design affect incentives to save and invest; how market failures and administrative problems may influence the optimality of different tax policies; the implications of global capital flows and corporate tax avoidance for the design of tax policy; tax holidays and other special tax incentives for investment; empirical evidence on the influence of taxes on economic growth, foreign direct investment, labor supply, and tax evasion; tax policy towards natural resources such as minerals and oil; case studies of efforts to reform tax administration and reduce tax evasion and corruption; taxes on land and property; taxes on imports and exports; presumptive taxation; and the informal economy and its implications for tax policy."
  },
  {
    "Subject": "ECON",
    "Number": 390,
    "Attributes": "DIV_D2,POEC_POECCOMP,WAC_WAC",
    "Professor": "Gerard Caprio",
    "Title": "ECON 390 Financal Crises: Causes & Cure",
    "Tags": "economics;macroeconomics;economics graduate school;asset management; global economics;research;global development",
    "Timeslot": "TBA - ; - ; -",
    "Prereqs": "ECON 252; ECON 255",
    "Description": "Financial crises have been with us for as long as banking has existed. Why are crises such a regular fixture of societies, and what can be done to prevent them, or at least reduce their cost? Topics examined include bubbles and swindles, especially when these spillover to the broader macroeconomy; the role of information in banking in normal times and in bank runs; boom-bust cycles in asset markets; international contagion; crisis resolution techniques; and the extensive history of attempts to improve regulation so as to reduce the frequency and cost of crises. Crises in developing and developed economies from the South Sea Bubble to the Euro Crisis will be examined, and the role of political economy factors in their run-up and resolution will be featured."
  },
  {
    "Subject": "MATH",
    "Number": 130,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Pamela E. Harris",
    "Title": "MATH 130 Calculus I",
    "Tags": "mathematics;modelling;engineering;economics;research;applied mathematics;ESSENTIALS;intro class",
    "Timeslot": "TR 09:55-11:10; - ; -",
    "Prereqs": "MATH 102",
    "Description": "Calculus permits the computation of velocities and other instantaneous rates of change by a limiting process called differentiation. The same process also solves \"max-min\" problems: how to maximize profit or minimize pollution. A second limiting process, called integration, permits the computation of areas and accumulations of income or medicines. The Fundamental Theorem of Calculus provides a useful and surprising link between the two processes. Subtopics include trigonometry, exponential growth, and logarithms."
  },
  {
    "Subject": "MATH",
    "Number": 140,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Susan R. Loepp",
    "Title": "MATH 140 Calculus II",
    "Tags": "mathematics;integration;animation;economics;engineering;research;applied mathematics;intro class",
    "Timeslot": "MWF 09:00-09:50; - ; -",
    "Prereqs": "MATH 130",
    "Description": "Mastery of calculus requires understanding how integration computes areas and business profit and acquiring a stock of techniques. Further methods solve equations involving derivatives (\"differential equations\") for population growth or pollution levels. Exponential and logarithmic functions and trigonometric and inverse functions play an important role. This course is the right starting point for students who have seen derivatives, but not necessarily integrals, before."
  },
  {
    "Subject": "MATH",
    "Number": 150,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Stewart D. Johnson",
    "Title": "MATH 150 Multivariable Calculus",
    "Tags": "mathematics;volumes;engineering;statistician;animation;research;applied mathematics;intro class",
    "Timeslot": "MWF 09:00-09:50; - ; -",
    "Prereqs": "MATH 140",
    "Description": "Applications of calculus in mathematics, science, economics, psychology, the social sciences, involve several variables. This course extends calculus to several variables: vectors, partial derivatives, multiple integrals. There is also a unit on infinite series, sometimes with applications to differential equations."
  },
  {
    "Subject": "MATH",
    "Number": 200,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Leo Goldmakher",
    "Title": "MATH 200 Discrete Math",
    "Tags": "mathematics;computer science;proof based mathematics;number theory;finance;quantitative trading;wall street;",
    "Timeslot": "MWF 10:00-10:50; - ; -",
    "Prereqs": "MATH 140",
    "Description": "Course Description: In contrast to calculus, which is the study of continuous processes, this course examines the structure and properties of finite sets. Topics to be covered include mathematical logic, elementary number theory, mathematical induction, set theory, functions, relations, elementary combinatorics and probability, graphs and trees, and algorithms. Emphasis will be given on the methods and styles of mathematical proofs, in order to prepare the students for more advanced math courses."
  },
  {
    "Subject": "MATH",
    "Number": 210,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Daniel P. Aalberts",
    "Title": "MATH 210 Math Methods for Scientists",
    "Tags": "mathematics;physics;research;differential equations;applied mathematics;computational mathematics;",
    "Timeslot": "TR 09:55-11:10; - ; -",
    "Prereqs": "MATH 151",
    "Description": "This course covers a variety of mathematical methods used in the sciences, focusing particularly on the solution of ordinary and partial differential equations. In addition to calling attention to certain special equations that arise frequently in the study of waves and diffusion, we develop general techniques such as looking for series solutions and, in the case of nonlinear equations, using phase portraits and linearizing around fixed points. We study some simple numerical techniques for solving differential equations. A series of optional sessions in Mathematica will be offered for students who are not already familiar with this computational tool."
  },
  {
    "Subject": "MATH",
    "Number": 250,
    "Attributes": "COGS_COGSREL,DIV_D3,QFR_QFR",
    "Professor": "Thomas A. Garrity",
    "Title": "MATH 250 Linear Algebra",
    "Tags": "mathematics;modeling;data science;computer science;engineering;proof based mathematics",
    "Timeslot": "MWF 10:00-10:50; - ; -",
    "Prereqs": "MATH 151; MATH 200",
    "Description": "Many social, political, economic, biological, and physical phenomena can be described, at least approximately, by linear relations. In the study of systems of linear equations one may ask: When does a solution exist? When is it unique? How does one find it? How can one interpret it geometrically? This course develops the theoretical structure underlying answers to these and other questions and includes the study of matrices, vector spaces, linear independence and bases, linear transformations, determinants and inner products. Course work is balanced between theoretical and computational, with attention to improving mathematical style and sophistication."
  },
  {
    "Subject": "MATH",
    "Number": 309,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Chad M. Topaz",
    "Title": "MATH 309 Differential Equations",
    "Tags": "mathematics;modeling;applied mathematics;wall street;finance;quantitative trading;financial markets;",
    "Timeslot": "TR 11:20-12:35; - ; -",
    "Prereqs": "MATH 151; MATH 250",
    "Description": "Ordinary differential equations (ODE) frequently arise as models of phenomena in the natural and social sciences. This course presents core ideas of ODE from an applied standpoint. Topics covered early in the course include numerical solutions, separation of variables, integrating factors, constant coefficient linear equations, and power series solutions. Later, we focus on nonlinear ODE, for which it is usually impossible to find analytical solutions. Tools from dynamical systems allows us to obtain some information about the behavior of the ODE without explicitly knowing the solution."
  },
  {
    "Subject": "MATH",
    "Number": 310,
    "Attributes": "DIV_D3,PHLH_PHLHMETH,QFR_QFR",
    "Professor": "Julie C. Blackwood",
    "Title": "MATH 310 Mathematical Biology",
    "Tags": "mathematics;biology;mathematical science;modeling;science graduate school;mathematics graduate school;medical research",
    "Timeslot": "TBA - ; - ; -",
    "Prereqs": "MATH 250; MATH 209",
    "Description": "This course will provide an introduction to the many ways in which mathematics can be used to understand, analyze, and predict biological dynamics. We will learn how to construct mathematical models that capture essential properties of biological processes while maintaining analytic tractability. Analytic techniques, such as stability and bifurcation analysis, will be introduced in the context of both continuous and discrete time models. Additionally, students will couple these analytic tools with numerical simulation to gain a more global picture of the biological dynamics. Possible biological applications include, but are not limited to, single and multi-species population dynamics, neural and biological oscillators, tumor cell growth, and infectious disease dynamics."
  },
  {
    "Subject": "MATH",
    "Number": 321,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Colin C. Adams",
    "Title": "MATH 321 Knot Theory",
    "Tags": "proof based mathematics;mathematics graduate school;chemistry;physics;",
    "Timeslot": "MWF 08:30-09:45; - ; -",
    "Prereqs": "MATH 250",
    "Description": "Take a piece of string, tie a knot in it, and glue the ends together. The result is a knotted circle, known as a knot. For the last 100 years, mathematicians have studied knots, asking such questions as, \"Given a nasty tangled knot, how do you tell if it can be untangled without cutting it open?\" Some of the most interesting advances in knot theory have occurred in the last ten years.This course is an introduction to the theory of knots. Among other topics, we will cover methods of knot tabulation, surfaces applied to knots, polynomials associated to knots, and relationships between knot theory and chemistry and physics. In addition to learning the theory, we will look at open problems in the field."
  },
  {
    "Subject": "MATH",
    "Number": 334,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Ralph E. Morrison",
    "Title": "MATH 334 Graph Theory",
    "Tags": "mathematics;proof based mathematics;mathematics graudate school;computer science;software engineering;",
    "Timeslot": "TR 09:55-11:10; - ; -",
    "Prereqs": "MATH 200",
    "Description": "A graph is a collection of vertices, joined together by edges. In this course, we will study the sorts of structures that can be encoded in graphs, along with the properties of those graphs. We'll learn about such classes of graphs as multi-partite, planar, and perfect graphs, and will see applications to such optimization problems as minimum colorings of graphs, maximum matchings in graphs, and network flows."
  },
  {
    "Subject": "MATH",
    "Number": 341,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Thomas A. Garrity",
    "Title": "MATH 341 Probability",
    "Tags": "mathematics;applied mathematics;wall street;finance;finacial markets;quantitative trading;private equity;",
    "Timeslot": "MWF 09:00-09:50; - ; -",
    "Prereqs": "MATH 250",
    "Description": "While probability began with a study of games, it has grown to become a discipline with numerous applications throughout mathematics and the sciences. Drawing on gaming examples for motivation, this course will present axiomatic and mathematical aspects of probability. Included will be discussions of random variables, expectation, independence, laws of large numbers, and the Central Limit Theorem. Many interesting and important applications will also be presented, potentially including some from coding theory, number theory and nuclear physics."
  },
  {
    "Subject": "MATH",
    "Number": 350,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Cesar E. Silva",
    "Title": "MATH 350 Real Analysis",
    "Tags": "proof based mathematics;mathematics;mathematics graduate school;calculus;",
    "Timeslot": "MWF 10:00-10:50; - ; -",
    "Prereqs": "MATH 150; MATH 151; MATH 250",
    "Description": "Real analysis is the theory behind calculus. It is based on a precise understanding of the real numbers, elementary topology, and limits. Topologically, nice sets are either closed (contain their limit points) or open (complement closed). You also need limits to define continuity, derivatives, integrals, and to understand sequences of functions."
  },
  {
    "Subject": "MATH",
    "Number": 355,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Allison Pacelli",
    "Title": "MATH 355 Abstract Algebra",
    "Tags": "mathematics;proof based mathematics;mathematics graduate school;computer science;",
    "Timeslot": "TR 09:55-11:10; - ; -",
    "Prereqs": "MATH 250",
    "Description": "Algebra gives us tools to solve equations. The integers, the rationals, and the real numbers have special properties which make algebra work according to the circumstances. In this course, we generalize algebraic processes and the sets upon which they operate in order to better understand, theoretically, when equations can and cannot be solved. We define and study abstract algebraic structures such as groups, rings, and fields, as well as the concepts of factor group, quotient ring, homomorphism, isomorphism, and various types of field extensions. This course introduces students to abstract rigorous mathematics."
  },
  {
    "Subject": "AFR",
    "Number": 113,
    "Attributes": "DIV_D2,GBST_GBSTAFR,MUS_MUSW",
    "Professor": "Corinna S. Campbell",
    "Title": "AFR 113 Musics of Africa",
    "Tags": "music;africa;social issues;political issues;performance analysis;africana studies",
    "Timeslot": "MW 11:00-12:15; - ; -",
    "Prereqs": "",
    "Description": "This course introduces a selection of musical cultures from the geographical breadth of Africa. Following an introductory exploration of the fundamental aesthetic and social parameters governing African musical practice, we will engage in a series of case studies considering a diverse array of musical practices and related social and political issues in specific locales. Featured countries include Ghana, Zimbabwe, Ethiopia, Algeria and the Democratic Republic of Congo. This course samples a wide range of musical practices from the Ghanaian dance craze, azonto, to Ethiopian liturgical chants, to Shona mbira music in Zimbabwe. Performance analysis and critical reading and listing assignments are combined with a number of hands-on workshops and musical exercises."
  },
  {
    "Subject": "ENGL",
    "Number": 201,
    "Attributes": "DIV_D1,ENGL_ENGLLHA",
    "Professor": "Andrew C. Miller",
    "Title": "ENGL 201 Shakespeare",
    "Tags": "theatre;shakespeare;renaissance;playwrighting;literary imitation;publication;english",
    "Timeslot": "TF 13:10-14:25; - ; -",
    "Prereqs": "",
    "Description": "This course introduces a selection of musical cultures from the geographical breadth of Africa. Following an introductory exploration of the fundamental aesthetic and social parameters governing African musical practice, we will engage in a series of case studies considering a diverse array of musical practices and related social and political issues in specific locales. Featured countries include Ghana, Zimbabwe, Ethiopia, Algeria and the Democratic Republic of Congo. This course samples a wide range of musical practices from the Ghanaian dance craze, azonto, to Ethiopian liturgical chants, to Shona mbira music in Zimbabwe. Performance analysis and critical reading and listing assignments are combined with a number of hands-on workshops and musical exercises."
  },
  {
    "Subject": "PHIL",
    "Number": 203,
    "Attributes": "DIV_D2,LING_LING,PHIL_M&E,QFR_QFR",
    "Professor": "Steven B. Gerrard",
    "Title": "PHIL 203 Logic and Language",
    "Tags": "logic;arguments;critical thinking;philosophy;contemporary metaphysics",
    "Timeslot": "MWF 10:00-10:50; - ; -",
    "Prereqs": "",
    "Description": "Logic is the study of reasoning and argument. More particularly, it concerns itself with the difference between good and bad reasoning, between strong and weak arguments. We all examine the virtues and vices of good arguments in both informal and formal systems. The goals of this course are to improve the critical thinking of the students, to introduce them to sentential and predicate logic, to familiarize them with enough formal logic to enable them to read some of the great works of philosophy, which use formal logic (such as Wittgenstein's <I>Tractatus</I>), and to examine some of the connections between logic and philosophy."
  },
  {
    "Subject": "PHIL",
    "Number": 123,
    "Attributes": "DIV_D2,WAC_WAC",
    "Professor": "Melissa J. Barry",
    "Title": "PHIL 123 Objectivity in Ethics",
    "Tags": "ethics;philosophy",
    "Timeslot": "MR 14:35-15:50; - ; -",
    "Prereqs": "",
    "Description": "Is morality simply a matter of opinion? In this course we'll examine several influential attempts to provide a rational foundation for morality, along with Nietzsche's wholesale rejection of these efforts. Readings will include work by Plato, Hobbes, Kant, Mill, Nietzsche, and contemporary authors."
  },
  {
    "Subject": "PHYS",
    "Number": 132,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Savan Kharel",
    "Title": "PHYS 132 Electromagn&Physics of Matter",
    "Tags": "electromagnetism;physics;special relativity;quantum theory;nuclear physics;physics gradute school;",
    "Timeslot": "MWF 11:00-11:50; - ; -",
    "Prereqs": "PHYS 131",
    "Description": "This course is intended as the second half of a one-year survey of physics with some emphasis on applications to medicine. In the first part of the semester we will focus on electromagnetic phenomena. We will introduce the concept of electric and magnetic fields and study in detail the way in which electrical circuits and circuit elements work. The deep connection between electric and magnetic phenomena is highlighted with a discussion of Faraday's Law of Induction. Following our introduction to electromagnetism we will discuss some of the most central topics in twentieth-century physics, including Einstein's theory of special relativity and some aspects of quantum theory. We will end with a treatment of nuclear physics, radioactivity, and uses of radiation."
  },
  {
    "Subject": "PSYC",
    "Number": 101,
    "Attributes": "DIV_D2,NSCI_NSCIREQ,TEAC_TEACSEQ",
    "Professor": "Noah J. Sandstrom",
    "Title": "PSYC 101 Introductory Psychology",
    "Tags": "psychology;social psychology;cognitive psychology;behavioral psychology;neuroscience;intro class;",
    "Timeslot": "MWF 10:00-10:50; - ; -",
    "Prereqs": "",
    "Description": "An introduction to the major subfields of psychology: behavioral neuroscience, cognitive, developmental, social, and psychological disorders and treatment. The course aims to acquaint students with the major methods, theoretical points of view, and findings of each subfield. Important concepts are exemplified by a study of selected topics and issues within each of these areas."
  },
  {
    "Subject": "SCST",
    "Number": 101,
    "Attributes": "DIV_D2",
    "Professor": "Grant Shoffstall",
    "Title": "SCST 101 Science,Technolgy&Human Values",
    "Tags": "philosophy;history;science;technology;ethics;sociology;anthropology;Science and Technology Studies",
    "Timeslot": "MWF 08:30-09:45; - ; -",
    "Prereqs": "",
    "Description": "This course offers an introduction to science and technology studies, or STS. A radically interdisciplinary field of inquiry, the roots of STS stretch through the philosophy, history, and sociology/anthropology of science and technology. Students will become acquainted with major STS schools, methodological strategies and research trajectories through intensive reading and analysis of classical and contemporary works in the field. Considerable attention will be devoted to exploring the nature of science and technology, their relationships to and interactions with one another, society and the natural world, and the influences these interactions exert in shaping what humans value. A fundamental goal of the course is to cultivate awareness and understanding of the social organization of technology and scientific knowledge production, and the technoscientific structuring of modern social life broadly. The course as such is aimed at attracting from all divisions those students who are intellectually adventurous and inclined to think critically about the place and prominence of science and technology in the modern world."
  },
  {
    "Subject": "SOC",
    "Number": 241,
    "Attributes": "DIV_D2,POEC_POECCOMP,PSCI_PSCIAMER,PSCI_PSCICOMP",
    "Professor": "Darel E. Paul",
    "Title": "SOC 241 Meritocracy",
    "Tags": "meritocracy;power;sociology;equity;public policy;political science;comparative politics;Sociology",
    "Timeslot": "TF 13:10-14:25; - ; -",
    "Prereqs": "",
    "Description": "Although an infinitesimal number of Americans have degrees from Harvard or Yale Universities, 33% of the top decision makers in the second Obama administration did. So do eight of the country's nine sitting Supreme Court Justices. Is this a positive sign that the United States is governed by its most talented and capable members who have risen through hard work and equal opportunity? Or a negative one pointing to the power of a corrupt and self-selecting elite? This course explores the theme of meritocracy --- rule by the intellectually talented --- in comparative perspective. We will look at both old and new arguments regarding the proper role and definition of merit in political society as well as take the measure of meritocracy in present-day Singapore, France, and the United States. The course concludes with a focus on the current debate over American meritocracy and inequality."
  },
  {
    "Subject": "STAT",
    "Number": 161,
    "Attributes": "DIV_D3,QFR_QFR",
    "Professor": "Richard D. De Veaux",
    "Title": "STAT 161 Intro Stat Social Science",
    "Tags": "statistics;data analysis;regression;logic;mathematics;social sciences;intro class;finance",
    "Timeslot": "TF 13:10-14:25; - ; -",
    "Prereqs": "MATH 130",
    "Description": "This course will cover the basics of modern statistical analysis with a view toward applications in the social sciences and sciences. Topics include exploratory data analysis, elements of probability theory, basic statistical inference, and introduction to statistical modeling. The course focuses on the application of statistics tools to solve problems, to make decisions, and the use of statistical thinking to understand the world."
  },
  {
    "Subject": "WGSS",
    "Number": 261,
    "Attributes": "DIV_D2,WAC_WAC",
    "Professor": "M. Jennifer Bloxam",
    "Title": "WGSS 261 Lost Voices of Medieval Women",
    "Tags": "music;music history;women gender sexuality studies;power;middle ages;music of the world;",
    "Timeslot": "TR 09:55-11:10; - ; -",
    "Prereqs": "",
    "Description": "Very few female voices from the Middle Ages are audible today; most of the music, poetry, and other writings that survives reveals the creativity and expresses the attitudes of men. This course will explore the experiences and viewpoints of medieval women through the lens of the poetry and songs of two exceptional 12th-century figures: the German abbess Hildegard of Bingen, whose long and immensely productive life was shaped by the requirements of monastic culture; and the French Countess of Dia in Provence, whose elusive life and works exemplify the dynamics of aristocratic court culture. We will ask how these and other musical women active in both the sacred and the secular spheres (such as the nun Birgitta of Sweden, and Queen Blanche of Castile) negotiated their places and made their voices heard within the patriarchal society of their time. We will examine the ways in which these contrasting environments informed the different outlooks, ideas, and aesthetics expressed in the words and music of their songs. Along the way we will critically assess how these lost voices have been recreated to speak to us today through recordings and film."
  },
  {
    "Subject": "LEAD",
    "Number": 215,
    "Attributes": "DIV_D2,LEAD_LEADFAC,POEC_POECAMER",
    "Professor": "Mason B. Williams",
    "Title": "LEAD 215 Race & Inequality in US City",
    "Tags": "leadership studies;race;power;inequality;us politics;political science;social justice;",
    "Timeslot": "TF 14:35-15:50; - ; -",
    "Prereqs": "",
    "Description": "In the past half-century, American cities have gotten both much richer and much poorer. The making of \"luxury cities\" has gone hand-in-hand with persistent, concentrated poverty, extreme racial segregation, mass incarceration, and failing public services-social problems borne primarily by people of color. This course will examine the political underpinnings of inequality in American cities, with particular attention to the racialization of inequality. Among the topics we will cover are: the structures of urban political power; housing and employment discrimination; the War on Crime and the War on Drugs (and their consequence, mass incarceration); education; and gentrification. We will ask: How have city leaders and social movements engaged with urban problems? How have they tried to make cities more decent, just, and sustainable? Under what circumstances has positive leadership produced beneficial outcomes, and in what circumstances has it produced perverse outcomes? We will engage primarily with political science, but also with scholarship in other disciplines, including sociology, history, geography, and legal studies, all of which share an interest in the questions we will be exploring. Students will leave this course with a deeper understanding of contemporary urban problems, a knowledge of the political structures within which those problems are embedded, and a better sense of the challenges and opportunities leaders face in contemporary urban America."
  }
]
